<p>B&agrave;i trước m&igrave;nh đ&atilde; giới thiệu v&agrave; hướng dẫn c&aacute;ch c&agrave;i đặt Laravel. B&agrave;i h&ocirc;m nay m&igrave;nh xin n&oacute;i sơ lượt về cấu tr&uacute;c thư mục trong Laravel 5 cụ thể ở đ&acirc;y l&agrave; Laravel phi&ecirc;n bản 5.4.</p>

<p><strong>Cấu tr&uacute;c thư mục trong Laravel 5:</strong></p>

<p style="text-align: center"><img alt="" src="http://laedaily.com/laravel-filemanager/photos/1/laravel/bai2/1.png" /></p>

<p><strong>- app:</strong>&nbsp;Chứa models, controllers, middlewares, request, ... đ&acirc;y l&agrave; thư mục code ch&iacute;nh m&agrave; bạn sẽ thao t&aacute;c nhiều sau n&agrave;y.<br />
<strong>- bootstrap:</strong>&nbsp;Chứa một số file của bootstrap framework v&agrave; một số file cấu h&igrave;nh nạp tự động.<br />
<strong>- config:</strong>&nbsp;Chứa c&aacute;c file cấu h&igrave;nh hệ thống như database, mail, filesystems, ...<br />
<strong>- database:</strong> migrations: nơi bạn sẽ khởi tạo database, seeds: nơi sẽ khởi tạo dữ liệu insert mẫu v&agrave;o database.<br />
<strong>- public:</strong> Thư mục public cũng d&ugrave;ng cho việc lưu trữ những file như css, javascripts, file images v&agrave; những file kh&aacute;c. N&oacute; cũng chứa file khởi động index.php.<br />
<strong>- resources:</strong>&nbsp;Chứa assets, lang, views (chứa file cấu tr&uacute;c html)<br />
<strong>- routes:</strong>&nbsp;Chứa c&aacute;c file api.php, channels.php, console.php, web.php. Ở đay ta chủ yếu quan t&acirc;m tới file web.php n&oacute; lưu trứ to&agrave;n bộ những route để th&ocirc;ng b&aacute;o với Laravel c&aacute;ch như thế n&agrave;o để kết nối khi c&oacute; y&ecirc;u cầu, theo h&agrave;m khai sẵn, controller v&agrave; action.<br />
<strong>- storage:</strong>&nbsp;Để lưu trữ file tạm thời cho những dịch vụ Laravel kh&aacute;c nhau như session, cache, bi&ecirc;n dịch template views.<br />
<strong>- tests:</strong>&nbsp;Chứa c&aacute;c test tự động của bạn.<br />
<strong>- vendor:</strong>&nbsp;Nơi n&agrave;y chứa to&agrave;n bộ code của b&ecirc;n thứ ba. Chứa plugin ch&uacute;ng ta c&agrave;i th&ecirc;m cho ứng dụng ch&uacute;ng ta.Chứa cả c&aacute;c composer package sử dụng bởi ứng dụng.</p>

<p>Trong b&agrave;i n&agrave;y m&igrave;nh đ&atilde; giới thiệu sơ lượt cấu tr&uacute;c thư mục trong Laravel 5.&nbsp;Trong series b&agrave;i viết tiếp theo m&igrave;nh sẽ hướng dẫn c&aacute;c bạn về <code>Route</code> trong&nbsp;Laravel 5. Mời c&aacute;c bạn đ&oacute;n đọc. B&agrave;i viết tr&ecirc;n l&agrave; những hiểu biết của c&aacute; nh&acirc;n m&igrave;nh n&ecirc;n kh&ocirc;ng tr&aacute;nh phải sai s&oacute;t, rất mong sự đ&oacute;ng g&oacute;p &yacute; kiến của c&aacute;c bạn để b&agrave;i viết trở n&ecirc;n hữu &iacute;ch hơn.</p>
